## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:39" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:39" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 39 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
      ~ etag                   = "6b37f8b0bc9fdf8b1860a5ea667850b5-5" -> "33197d2b5c1fd56ba250eb5e465a0c4b"
        id                     = "cpfValidation.33197d2b5c1fd56ba250eb5e465a0c4b.zip"
        tags                   = {}
      ~ version_id             = "5EMW5HtM5soH25Wl9KzXZntzhKd1xmR7" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-excelToJson" {
      ~ etag                   = "609a397e9343c863307b70227cbb2c9a-6" -> "a353743c6db71a81967ec6cbdfe9b209"
        id                     = "excelToJson.a353743c6db71a81967ec6cbdfe9b209.zip"
        tags                   = {}
      ~ version_id             = "bjyAvGiPCG5Tx.q5nKFwsuAnvIO8_4db" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "57608fbd60233e899b4bdf0ba237112b-6" -> "a69909464baa18857436b267071324da"
      ~ id                     = "graphql.5c88d80bd1a0906b2c13ba8e1cba4a4e.zip" -> (known after apply)
      ~ key                    = "graphql.5c88d80bd1a0906b2c13ba8e1cba4a4e.zip" -> "graphql.a69909464baa18857436b267071324da.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "5c88d80bd1a0906b2c13ba8e1cba4a4e" -> "a69909464baa18857436b267071324da"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "GuWLZ7yLKz.lHRY47JdX.1gzlU9QOUfH" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "f03ec166348600f77b20ebd25f8f48ca" -> "e521c736ea9a9d3b1902e53c7341be14"
        id                     = "dist/200.html"
      ~ source_hash            = "f03ec166348600f77b20ebd25f8f48ca" -> "e521c736ea9a9d3b1902e53c7341be14"
        tags                   = {}
      ~ version_id             = "fI.mnI9kOTh.JJAYZMJUTtEbyeYMBGK7" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "3250ec525f6443df040bf534151f89d6" -> "08bfaab22cf935982084711e073d1b62"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "3250ec525f6443df040bf534151f89d6" -> "08bfaab22cf935982084711e073d1b62"
        tags                   = {}
      ~ version_id             = "WtpD0l1PvDv7WO2vgMEaVH1COdBwALF8" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "5e5878b6694924ad8b54404912c6b24a" -> "bb19cc905bb105ec4229ff56eddfd5f8"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "5e5878b6694924ad8b54404912c6b24a" -> "bb19cc905bb105ec4229ff56eddfd5f8"
        tags                   = {}
      ~ version_id             = "wLPLsXQxosaWzc4n63HP.J6sbFLhbbI." -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "f03ec166348600f77b20ebd25f8f48ca" -> "e521c736ea9a9d3b1902e53c7341be14"
        id                     = "dist/index.html"
      ~ source_hash            = "f03ec166348600f77b20ebd25f8f48ca" -> "e521c736ea9a9d3b1902e53c7341be14"
        tags                   = {}
      ~ version_id             = "m3OOnIGRdytGywziq0zLc7sBD3GF4TmJ" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a4a59ef2.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "477001a4168880f36a33d621b9e8d254"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.a4a59ef2.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a4a59ef2.js"
+       source_hash            = "477001a4168880f36a33d621b9e8d254"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a4a59ef2.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "8d38c03ef794fa32760c896577fdf875"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.a4a59ef2.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a4a59ef2.js.LICENSE.txt"
+       source_hash            = "8d38c03ef794fa32760c896577fdf875"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.dc52b528.js"] will be destroyed
  # (because key ["static/js/app.dc52b528.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "54d091f9e28c9fa4b20df82df19af1e3" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.dc52b528.js" -> null
-       key                    = "dist/static/js/app.dc52b528.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.dc52b528.js" -> null
-       source_hash            = "54d091f9e28c9fa4b20df82df19af1e3" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "lhtzySwz4FsQ1ZbvGI2RNIkOSgXTdMe6" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.dc52b528.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.dc52b528.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "8d38c03ef794fa32760c896577fdf875" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.dc52b528.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.dc52b528.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.dc52b528.js.LICENSE.txt" -> null
-       source_hash            = "8d38c03ef794fa32760c896577fdf875" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "596qlfx7U6E3AEnZj4YrgiR2xHLHCUCn" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:8/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "3c37305234b489f50d0fca20c88416720897c872" -> "bd5990c7e587201e7c94e564fd7a38dd28e815b3"
              ~ "DD_TAGS"                      = "git.commit.sha:3c37305234b489f50d0fca20c88416720897c872,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:bd5990c7e587201e7c94e564fd7a38dd28e815b3,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "3c37305234b489f50d0fca20c88416720897c872" -> "bd5990c7e587201e7c94e564fd7a38dd28e815b3"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "8" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:8/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "3c37305234b489f50d0fca20c88416720897c872" -> "bd5990c7e587201e7c94e564fd7a38dd28e815b3"
              ~ "DD_TAGS"                      = "git.commit.sha:3c37305234b489f50d0fca20c88416720897c872,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:bd5990c7e587201e7c94e564fd7a38dd28e815b3,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "3c37305234b489f50d0fca20c88416720897c872" -> "bd5990c7e587201e7c94e564fd7a38dd28e815b3"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "8" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2024-01-18T15:41:54.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:55" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:55/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.5c88d80bd1a0906b2c13ba8e1cba4a4e.zip" -> "graphql.a69909464baa18857436b267071324da.zip"
        tags                           = {}
      ~ version                        = "55" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "3c37305234b489f50d0fca20c88416720897c872" -> "bd5990c7e587201e7c94e564fd7a38dd28e815b3"
              ~ "DD_TAGS"                            = "git.commit.sha:3c37305234b489f50d0fca20c88416720897c872,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:bd5990c7e587201e7c94e564fd7a38dd28e815b3,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "3c37305234b489f50d0fca20c88416720897c872" -> "bd5990c7e587201e7c94e564fd7a38dd28e815b3"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "55" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 10 to change, 7 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7589578159)*